Revit 2027 API
ExternalDataManagerDataItemId(Int64) Constructor
 Constructor
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternalDataManagerDataItemId(
	long id
)
Public Sub New (
	id As Long
)
public:
ExternalDataManagerDataItemId(
	long long id
)
new :
        id : int64 -> ExternalDataManagerDataItemId
Parameters
id Int64
 The identity of the data item.
See Also
Reference
ExternalDataManagerDataItemId Class
ExternalDataManagerDataItemId Overload
Autodesk.Revit.UI Namespace